In [1]:
import pandas as pd

In [2]:
ms = pd.read_csv('data/masterstudies_usa_filtered_jun1_2021.csv')
fam = pd.read_csv('data/findamasters_usa_filtered_jun1_2021.csv')
spm = pd.read_csv('data/studyportalsmasters_usa_filtered_jun2_2021.csv')

In [7]:
datasets = [ms, fam, spm]

In [4]:
ms.head(2)

,title,url,school,degree,pace,duration,based,point_duration
0,MS Analytics,https://www.masterstudies.com/MS-Analytics/USA...,"Kogod School of Business, American University",MSc,Full-time ...,1-3Years,Campus Online,24.0
1,MS in Marketing Analytics,https://www.masterstudies.com/MS-in-Marketing-...,University of Maryland College Park,MSc,Full-time,10-16Months,Campus,13.0

In [5]:
fam.head(2)

,title,institute,department
0,MS in Data Science,George Washington University,Columbian College of Arts and Sciences
1,Data Analytics (MSc),George Washington University,School of Engineering and Applied Sciences

In [6]:
spm.head(2)

,title,degree,school,location,price,duration
0,Analytics,M.Sc.,"Kogod School of Business, American University ...","Washington, D. C., Washington, D.C., United St...","1,481 EUR / credit",1 year
1,Masters in Business Analytics,M.Sc.,Hult International Business School,"San Francisco, California, United States","38,827 EUR / year",1 year

In [8]:
for d in datasets:
    print(d.shape)

(66, 8)
(15, 3)
(173, 6)

## Combine datasets

In [13]:
fam.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   title       15 non-null     object
 1   institute   15 non-null     object
 2   department  15 non-null     object
dtypes: object(3)
memory usage: 488.0+ bytes

In [14]:
ms.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           66 non-null     object
 1   url             66 non-null     object
 2   school          66 non-null     object
 3   degree          66 non-null     object
 4   pace            66 non-null     object
 5   duration        66 non-null     object
 6   based           66 non-null     object
 7   point_duration  66 non-null     float64
dtypes: float64(1), object(7)
memory usage: 4.2+ KB

In [15]:
spm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173 entries, 0 to 172
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   title     173 non-null    object
 1   degree    173 non-null    object
 2   school    173 non-null    object
 3   location  173 non-null    object
 4   price     173 non-null    object
 5   duration  173 non-null    object
dtypes: object(6)
memory usage: 8.2+ KB

In [19]:
ms = ms.rename(columns={
    'school': 'institution'
})
fam = fam.rename(columns={
    'institute': 'institution'
})
spm = spm.rename(columns={
    'school': 'institution'
})

In [20]:
ms.head(2)

,title,url,institution,degree,pace,duration,based,point_duration
0,MS Analytics,https://www.masterstudies.com/MS-Analytics/USA...,"Kogod School of Business, American University",MSc,Full-time ...,1-3Years,Campus Online,24.0
1,MS in Marketing Analytics,https://www.masterstudies.com/MS-in-Marketing-...,University of Maryland College Park,MSc,Full-time,10-16Months,Campus,13.0

In [21]:
fam.head(2)

,title,institution,department
0,MS in Data Science,George Washington University,Columbian College of Arts and Sciences
1,Data Analytics (MSc),George Washington University,School of Engineering and Applied Sciences

In [24]:
temp = ms.merge(right=fam, on=['institution', 'title'])

In [35]:
set((list(ms.institution))).intersection(set(list(spm.institution)))

{'Arizona State University',
 'Drew University',
 "Saint Peter's University",
 'San Diego State University',
 'Texas State University',
 'Yeshiva University'}

In [33]:
ms.institution.unique()

array(['Kogod School of Business, American University',
       'University of Maryland College Park',
       'Stevens Institute of Technology - Graduate Studies',
       'University of Memphis',
       'Gies College of Business at the University of Illinois Urbana-Champaign',
       'University of San Francisco - College of Arts & Sciences',
       'Babson College', 'The University of Findlay',
       'Hawaii Pacific University', "Saint Peter's University",
       'Tufts University - Graduate School of Arts and Sciences',
       'Georgetown University - Graduate School of Arts & Sciences',
       'Rochester Institute of Technology (RIT)',
       'University of North Dakota College of Engineering and Mines',
       'Case Western Reserve University, Weatherhead School of Management',
       'San Diego State University',
       'Nova Southeastern University, College of Computing and Engineering',
       'North Dakota State University', 'Drew University',
       'College of Charleston', 'Northern Arizona University',
       'University of North Texas College of Engineering',
       'New Jersey City University',
       'University of Pittsburgh School of Education',
       'Mercyhurst University', 'Embry-Riddle Aeronautical University',
       'Syracuse University - College of Arts and Sciences',
       'Syracuse University - iSchool',
       'NYU Steinhardt School of Culture, Education and Human Development',
       'The University of Texas at Dallas',
       'Rice University | Wiess School of Natural Sciences',
       'Bentley University - McCallum Graduate School of Business',
       'Golden Gate University', 'Texas State University',
       'University of Indianapolis, School of Business',
       'Clarkson University Graduate School',
       'University of Illinois at Chicago College of Urban Planning and Public Affairs',
       'University of New Haven',
       'University of Delaware, Alfred Lerner College of Business & Economics',
       'New York Institute of Technology (NYIT)',
       'Long Island University, Post Campus', 'Arizona State University',
       'Yeshiva University',
       'University of San Francisco - School of Management',
       'Towson University - College of Business & Economics',
       'Leavey School of Business', 'University Bocconi',
       'University of South Florida', 'McGovern Education Group',
       'Gordon College'], dtype=object)

In [30]:
fam.institution.unique()

array(['George Washington University', 'University of San Francisco',
       'Georgetown University', 'Rochester Institute of Technology USA',
       'The New School', 'Keck Graduate Institute',
       'New York Institute of Technology',
       'University of Colorado Boulder', 'Johns Hopkins University',
       'Simmons University'], dtype=object)

In [34]:
spm.institution.unique()

array(['Kogod School of Business, American University Washington DC',
       'Hult International Business School', 'Pace University',
       'University of Maryland Baltimore County (UMBC)',
       'South Dakota State University',
       'University of Michigan - Dearborn', 'University of Arizona',
       'University at Buffalo SUNY - School of Engineering and Applied Sciences',
       'The University of Texas at Arlington', 'Arizona State University',
       'Stanford University', 'Davenport University',
       'Georgetown University', 'University of Missouri - Columbia',
       'University of Southern California', 'Florida State University',
       'University of Chicago', 'University of Central Florida',
       'Chapman University', 'University of Massachusetts Lowell',
       'University of Central Oklahoma', 'University of Texas at Dallas',
       'Carnegie Mellon University', 'University of Findlay',
       'University of Delaware', 'Grand Valley State University',
       'University of Minnesota', 'Northeastern University',
       'The University of Texas at San Antonio',
       'The University of Vermont', 'Fordham University',
       "St. John's University", 'California State University Fullerton',
       'University of the Pacific', 'University of California, Berkeley',
       'Michigan Technological University',
       'University of California, San Diego',
       'Massachusetts Institute of Technology (MIT)',
       'University of Rochester', 'Tufts University',
       'Clemson University', 'Drew University', 'Columbia University',
       'Robert Morris University', 'Temple University',
       'University of North Dakota', "Saint Peter's University",
       'University of Central Missouri',
       'Icahn School of Medicine at Mount Sinai',
       'George Washington University',
       'The University of Alabama at Birmingham', 'Shepherd University',
       'University of Saint Thomas Saint Paul',
       'University of Massachusetts Dartmouth',
       'Montclair State University', 'Yeshiva University',
       'Radford University', 'American University Washington DC',
       'The City University of New York',
       'Illinois Institute of Technology', 'Johnson & Wales University',
       'Colorado School of Mines', 'Georgia Institute of Technology',
       'University of Maryland', 'University of Pennsylvania',
       'Rowan University', 'California Lutheran University',
       'Stockton University', 'Boston University',
       'The University of Tennessee at Chattanooga',
       'Wittenberg University', 'University of Kentucky',
       'Indiana University Bloomington', 'University of Michigan',
       'Pennsylvania State University', 'Georgia State University',
       'Fairfield University', 'Claremont Graduate University (CGU)',
       'San Diego State University', 'Yale University',
       'Worcester Polytechnic Institute', 'George Mason University',
       'Duke University', 'Catholic University of America',
       'Rutgers University', 'Dakota State University',
       'Florida International University', 'New York University',
       'Alliant International University', 'BAU', 'University of Denver',
       'University of Dallas', 'Bentley University',
       'Texas Tech University', 'University of San Francisco',
       'Central Connecticut State University',
       'New Jersey Institute of Technology',
       'University of Illinois Springfield', 'Clarkson University',
       'Utah State University', 'MIT Sloan School of Management',
       'DePaul University', 'Rochester Institute of Technology',
       'Colorado State University', 'San Francisco State University',
       'Lipscomb University', 'Harvard University',
       'Indiana University - Purdue University Indianapolis',
       'University of Houston Downtown', 'Pratt Institute',
       "Saint Mary's University of Minnesota",
       'Wentworth Institute of Technology',
       'Stevens Institute of Technology', 'College of William & Mary',
       'Politecnico di Torino', 'University of Cincinnati',
       'University of Georgia', 'Texas State University',
       'Drexel University College of Engineering',
       'Johns Hopkins University', 'Fitchburg State University',
       'University of Wisconsin Madison',
       'University of California, Los Angeles (UCLA)',
       'Hamline University', 'University of New Hampshire',
       'Rockhurst University', 'University of Illinois at Chicago',
       'Manhattan College'], dtype=object)

In [36]:
spm.head()

,title,degree,institution,location,price,duration
0,Analytics,M.Sc.,"Kogod School of Business, American University ...","Washington, D. C., Washington, D.C., United St...","1,481 EUR / credit",1 year
1,Masters in Business Analytics,M.Sc.,Hult International Business School,"San Francisco, California, United States","38,827 EUR / year",1 year
2,Customer Intelligence and Analytics,M.Sc.,Pace University,"New York City, New York, United States","1,099 EUR / credit",1 year
3,Data Science,Full-time,University of Maryland Baltimore County (UMBC),"Baltimore Highlands, Maryland, United States",925 EUR / credit,1 year
4,Data Science,M.Sc.,South Dakota State University,"Brookings, South Dakota, United States",530 EUR / credit,2 years

In [45]:
for t in list(spm.title):
    if 'vis' in t.lower():
        print(t)

Data Analytics and Visualization
Data Analysis and Visualization
Data Analytics and Visualization
Artificial Intelligence, Computer Vision, and Control